slowpoke/synthetic/fanout-w5-http-sync/bus-theory-microbenchmark/100reqbatching-1service.log
SLOWPOKE_DELAY_MICROS_SERVICE1=1500
SLOWPOKE_DELAY_MICROS_SERVICE0=0
SLOWPOKE_DELAY_MICROS_SERVICE3=740
SLOWPOKE_DELAY_MICROS_SERVICE2=502
SLOWPOKE_DELAY_MICROS_SERVICE5=670
SLOWPOKE_DELAY_MICROS_SERVICE4=560
SLOWPOKE_DELAY_MICROS_SERVICE6=680
SLOWPOKE_POKER_BATCH_THRESHOLD=10000000
PROCESSING_TIME_SERVICE4=0.000050
PROCESSING_TIME_SERVICE5=0.000020
PROCESSING_TIME_SERVICE6=0.000070
PROCESSING_TIME_SERVICE0=0.000709
PROCESSING_TIME_SERVICE1=0.000010
PROCESSING_TIME_SERVICE2=0.000032
PROCESSING_TIME_SERVICE3=0.000012
bash run.sh synthetic fanout-w5-http-sync 1 1 2000
[run.sh] Running benchmark synthetic with request fanout-w5-http-sync, thread 1, conn 1, duration 60
[run.sh] Deleting all services
configmap "config-service0" deleted
deployment.apps "service0" deleted
service "service0" deleted
configmap "config-service1" deleted
deployment.apps "service1" deleted
service "service1" deleted
configmap "config-service2" deleted
deployment.apps "service2" deleted
service "service2" deleted
configmap "config-service3" deleted
deployment.apps "service3" deleted
service "service3" deleted
configmap "config-service4" deleted
deployment.apps "service4" deleted
service "service4" deleted
configmap "config-service5" deleted
deployment.apps "service5" deleted
service "service5" deleted
configmap "config-service6" deleted
deployment.apps "service6" deleted
service "service6" deleted
deployment.apps "ubuntu-client" deleted
[run.sh] Waiting for all pods to be deleted
[run.sh] Deploying all services
configmap/config-service0 created
deployment.apps/service0 created
service/service0 created
configmap/config-service1 created
deployment.apps/service1 created
service/service1 created
configmap/config-service2 created
deployment.apps/service2 created
service/service2 created
configmap/config-service3 created
deployment.apps/service3 created
service/service3 created
configmap/config-service4 created
deployment.apps/service4 created
service/service4 created
configmap/config-service5 created
deployment.apps/service5 created
service/service5 created
configmap/config-service6 created
deployment.apps/service6 created
service/service6 created
[run.sh] Client pod not found, deploying client
deployment.apps/ubuntu-client created
[run.sh] Waiting for all pods to be running
[run.sh] All pods are running
[run.sh] Running warmup test
[run.sh] /wrk/wrk -t1 -c1 -d3s -L http://service0:80/endpoint1
Running 3s test @ http://service0:80/endpoint1
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.26ms   41.88ms 152.93ms   83.40%
    Req/Sec   298.44    155.38   500.00     52.00%
  Latency Distribution
     50%    2.16ms
     75%   22.82ms
     90%  101.95ms
     99%  148.85ms
  833 requests in 3.00s, 365.68KB read
Requests/sec:    277.60
Transfer/sec:    121.87KB
[run.sh] Speed is 277.60, duration is 10
[run.sh] Fix the request number.
[run.sh] Running the actual test
[run.sh] /wrk/wrk --timeout 20s -t1 -c1 -d20s -L http://service0:80/endpoint1
Running 20s test @ http://service0:80/endpoint1
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.34ms   41.90ms 152.87ms   82.88%
    Req/Sec   284.71    156.14   494.00     56.07%
  Latency Distribution
     50%    2.29ms
     75%   22.30ms
     90%  100.63ms
     99%  148.79ms
  5365 requests in 20.01s, 2.30MB read
Requests/sec:    268.05
Transfer/sec:    117.53KB
[run.sh] Checking the resource usage
NAME                             CPU(cores)   MEMORY(bytes)   
service0-5b4df75fcc-4j5db        311m         7Mi             
service1-5d48fc548-95mmk         23m          7Mi             
service2-7595d69994-pst2k        1m           2Mi             
service3-68d5b5f7bf-m5ghm        1m           2Mi             
service4-848cb799b4-nzmdc        1m           2Mi             
service5-7b64cd59bc-lj6h5        1m           2Mi             
service6-84cdff4f7c-x5zn7        1m           2Mi             
ubuntu-client-76886f6bbd-b8nmz   12m          0Mi             
[run.sh] Test finished with status 0