slowpoke/synthetic/fanout-w5-http-sync/bus-theory-microbenchmark/100reqbatching-6service-no-readall-again.log
SLOWPOKE_DELAY_MICROS_SERVICE1=1500
SLOWPOKE_DELAY_MICROS_SERVICE0=0
SLOWPOKE_DELAY_MICROS_SERVICE3=740
SLOWPOKE_DELAY_MICROS_SERVICE2=502
SLOWPOKE_DELAY_MICROS_SERVICE5=670
SLOWPOKE_DELAY_MICROS_SERVICE4=560
SLOWPOKE_DELAY_MICROS_SERVICE6=680
SLOWPOKE_POKER_BATCH_THRESHOLD=10000000
SLOWPOKE_PRERUN=false
PROCESSING_TIME_SERVICE4=0.000050
PROCESSING_TIME_SERVICE5=0.000020
PROCESSING_TIME_SERVICE6=0.000070
PROCESSING_TIME_SERVICE0=0.000709
PROCESSING_TIME_SERVICE1=0.000010
PROCESSING_TIME_SERVICE2=0.000032
PROCESSING_TIME_SERVICE3=0.000012
bash run.sh synthetic fanout-w5-http-sync 1 1 2000
[run.sh] Running benchmark synthetic with request fanout-w5-http-sync, thread 1, conn 1, duration 60
[run.sh] Deleting all services
configmap "config-service0" deleted
deployment.apps "service0" deleted
service "service0" deleted
configmap "config-service1" deleted
deployment.apps "service1" deleted
service "service1" deleted
configmap "config-service2" deleted
deployment.apps "service2" deleted
service "service2" deleted
configmap "config-service3" deleted
deployment.apps "service3" deleted
service "service3" deleted
configmap "config-service4" deleted
deployment.apps "service4" deleted
service "service4" deleted
configmap "config-service5" deleted
deployment.apps "service5" deleted
service "service5" deleted
configmap "config-service6" deleted
deployment.apps "service6" deleted
service "service6" deleted
deployment.apps "ubuntu-client" deleted
[run.sh] Waiting for all pods to be deleted
[run.sh] Deploying all services
configmap/config-service0 created
deployment.apps/service0 created
service/service0 created
configmap/config-service1 created
deployment.apps/service1 created
service/service1 created
configmap/config-service2 created
deployment.apps/service2 created
service/service2 created
configmap/config-service3 created
deployment.apps/service3 created
service/service3 created
configmap/config-service4 created
deployment.apps/service4 created
service/service4 created
configmap/config-service5 created
deployment.apps/service5 created
service/service5 created
configmap/config-service6 created
deployment.apps/service6 created
service/service6 created
[run.sh] Client pod not found, deploying client
deployment.apps/ubuntu-client created
[run.sh] Waiting for all pods to be running
[run.sh] All pods are running
[run.sh] Running warmup test
[run.sh] /wrk/wrk -t1 -c1 -d3s -L http://service0:80/endpoint1
Running 3s test @ http://service0:80/endpoint1
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    33.64ms    8.49ms  62.82ms   60.67%
    Req/Sec    29.67      8.09    40.00     46.67%
  Latency Distribution
     50%   36.27ms
     75%   38.31ms
     90%   43.88ms
     99%   62.82ms
  89 requests in 3.00s, 153.92KB read
Requests/sec:     29.65
Transfer/sec:     51.28KB
[run.sh] Speed is 29.65, duration is 101
[run.sh] Fix the request number.
[run.sh] Running the actual test
[run.sh] /wrk/wrk --timeout 20s -t1 -c1 -d20s -L http://service0:80/endpoint1
Running 20s test @ http://service0:80/endpoint1
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    34.62ms   19.07ms 178.03ms   93.80%
    Req/Sec    30.76      8.64    50.00     51.27%
  Latency Distribution
     50%   31.23ms
     75%   37.89ms
     90%   43.88ms
     99%  145.17ms
  609 requests in 20.01s, 1.03MB read
Requests/sec:     30.43
Transfer/sec:     52.63KB
[run.sh] Checking the resource usage
NAME                             CPU(cores)   MEMORY(bytes)   
service0-98c895858-x5w7x         301m         7Mi             
service1-85cff74847-wxpnk        13m          5Mi             
service2-7db68587ff-m4fhz        15m          5Mi             
service3-75645b7888-z6nvw        14m          5Mi             
service4-55d6d7499c-t5qq6        15m          5Mi             
service5-55c8bcfff4-66v4z        13m          5Mi             
service6-b87684558-bhqft         18m          5Mi             
ubuntu-client-76886f6bbd-5zg4l   3m           1Mi             
[run.sh] Test finished with status 0